
{
  "appName": "PiPulse",
  "sidebar": {
    "dashboard": "Dashboard",
    "team": "Team Insights",
    "node": "Node Analysis",
    "profile": "Profile",
    "settings": "Settings",
    "logout": "Logout",
    "adPlaceholder": "Your Ad Here",
    "help": "Help"
  },
  "login": {
    "welcome": "Welcome to PiPulse",
    "button": "Login with Pi",
    "error": "Login failed. Please try again."
  },
  "legal": {
    "termsTitle": "Terms of Service",
    "termsSections": [
      {
        "title": "PiPulse Terms of Service - Introduction",
        "content": "Effective Date: October 26, 2023\n\nWelcome to PiPulse! These Terms of Service ('Terms') govern your use of the PiPulse application and any related services (collectively, the 'Service'). By accessing or using our Service, you agree to be bound by these Terms."
      },
      {
        "title": "1. Acceptance of Terms",
        "content": "By using PiPulse, you confirm that you have read, understood, and agree to these Terms. If you do not agree with any part of these Terms, you must not use the Service."
      },
      {
        "title": "2. Description of Service",
        "content": "PiPulse is a third-party application designed to provide users with a dashboard to view their Pi Network related metrics, including Pi balance, mining rate, team member information, and node performance. PiPulse is not an official Pi Network application and is not a wallet. It does not store your private keys or facilitate Pi transactions."
      },
      {
        "title": "3. Use of Service",
        "content": "You agree to use the Service only for its intended purposes and in accordance with all applicable laws and regulations. You are responsible for maintaining the confidentiality of any account information related to your use of the Pi Network when interfacing with any third-party application."
      },
      {
        "title": "4. Data Accuracy and Mock Data",
        "content": "Currently, PiPulse utilizes mock data for demonstration and development purposes. In a live environment connected to the Pi Network, the accuracy of the data displayed would depend on the information made available by the Pi Network APIs and the data you authorize for access. PiPulse does not guarantee the absolute accuracy or timeliness of data that originates from the Pi Network."
      },
      {
        "title": "5. Disclaimer of Warranties",
        "content": "The Service is provided 'as is' and 'as available' without any warranties of any kind, express or implied. PiPulse does not warrant that the Service will be uninterrupted, error-free, or completely secure. PiPulse is not affiliated with the Pi Core Team or the Pi Network."
      },
      {
        "title": "6. Limitation of Liability",
        "content": "To the fullest extent permitted by law, PiPulse shall not be liable for any indirect, incidental, special, consequential, or punitive damages, or any loss of profits or revenues, whether incurred directly or indirectly, or any loss of data, use, goodwill, or other intangible losses, resulting from (a) your access to or use of or inability to access or use the Service; (b) any conduct or content of any third party on the Service; or (c) unauthorized access, use, or alteration of your transmissions or content, even if PiPulse has been advised of the possibility of such damages."
      },
      {
        "title": "7. Intellectual Property",
        "content": "The PiPulse name, logo, and all related names, logos, product and service names, designs, and slogans are trademarks of PiPulse or its licensors. Pi Network and the Pi logo are trademarks of the Pi Community Company. This Service is not endorsed by or affiliated with the Pi Network."
      },
      {
        "title": "8. Changes to Terms",
        "content": "We reserve the right to modify these Terms at any time. We will endeavor to provide notice of any significant changes. Your continued use of the Service after such changes constitutes your acceptance of the new Terms."
      },
      {
        "title": "9. Contact Us",
        "content": "If you have any questions about these Terms, please contact us at legal@pipulse.example.com."
      }
    ],
    "privacyTitle": "Privacy Policy",
    "privacySections": [
      {
        "title": "PiPulse Privacy Policy - Introduction",
        "content": "Effective Date: October 26, 2023\n\nPiPulse ('we', 'us', or 'our') is committed to protecting your privacy. This Privacy Policy explains how we handle information when you use our PiPulse application (the 'Service')."
      },
      {
        "title": "1. Our Relationship with Pi Network",
        "content": "PiPulse is an independent, third-party application. It is NOT an official application of the Pi Network or the Pi Core Team. This policy describes data handling by PiPulse, not by the Pi Network itself. For Pi Network's privacy practices, please refer to their official privacy policy."
      },
      {
        "title": "2. Information We Handle",
        "content": "When you use PiPulse, the application is designed to display information related to your Pi Network account, which may include:\n- Your Pi balance and its breakdown (e.g., transferable, unverified, lockups).\n- Your current Pi mining rate.\n- Information about your team members (e.g., name, status, contribution), as potentially made available by Pi Network APIs.\n- Node performance data (if you are a node operator and this data is accessible).\n- Profile information you might provide directly within PiPulse (e.g., display name, bio).\n\n**Important Note on Current Version:** The current version of PiPulse uses MOCK (simulated) DATA for all features. No actual connection to your Pi Network account is made, and no real Pi Network data is fetched or stored by PiPulse."
      },
      {
        "title": "3. How We Would Use Information (If Connected to Live Data)",
        "content": "If PiPulse were connected to live Pi Network data (which it currently is not), the information would be used solely to:\n- Provide you with the dashboard features: displaying your Pi-related metrics, team insights, and node analysis.\n- Allow you to customize your application experience (e.g., theme, language).\nWe would not sell your personal information. Access to your Pi Network data would require your explicit authorization through Pi Network's official mechanisms."
      },
      {
        "title": "4. Data Storage and Security",
        "content": "PiPulse is designed as a viewer or interface. It would not store sensitive Pi Network data like private keys. Application preferences (theme, language) are stored locally on your device. If handling real data, we would implement reasonable security measures to protect the information displayed."
      },
      {
        "title": "5. Third-Party Services and Advertisements",
        "content": "PiPulse does not share your Pi Network specific data with third-party advertisers. The application may contain placeholder elements for advertisements which are not functional in the current mock version and do not track you."
      },
      {
        "title": "6. Your Choices and Rights",
        "content": "Control over your Pi Network data resides with your Pi Network account and its official platform. PiPulse, as a third-party viewer, would only display data based on permissions you grant via the Pi Network. Profile information entered directly into PiPulse can be managed by you within the app."
      },
      {
        "title": "7. Children's Privacy",
        "content": "PiPulse is not intended for use by children under the age of 13 (or the relevant age in your jurisdiction). We do not knowingly collect personal information from children."
      },
      {
        "title": "8. Changes to This Privacy Policy",
        "content": "We may update this Privacy Policy from time to time. We will notify you of any significant changes by posting the new Privacy Policy within the application or on our website."
      },
      {
        "title": "9. Contact Us",
        "content": "If you have any questions about this Privacy Policy, please contact us at privacy@pipulse.example.com."
      }
    ],
    "returnToLogin": "Return to Login",
    "returnAction": "Return",
    "helpTitle": "Help & Support",
    "helpSections": [
      {
        "title": "Welcome to PiPulse Help & Support!",
        "content": "**What is PiPulse?**\nPiPulse is a third-party application designed to offer a dynamic and user-friendly interface for viewing your Pi Network related metrics. This includes your Pi balance, current mining rate, insights into your team's activity, and performance data if you operate a Pi Node."
      },
      {
        "title": "Is PiPulse an official Pi Network App?",
        "content": "No, PiPulse is an independent application developed by enthusiasts. It is not officially affiliated with, endorsed, or sponsored by the Pi Core Team or the Pi Network."
      },
      {
        "title": "How accurate is the data shown in PiPulse?",
        "content": "Currently, PiPulse uses MOCK (SIMULATED) DATA for all its features. This is for demonstration and development purposes. In a future version intended for live use, data accuracy would depend on the information provided by the official Pi Network APIs and the permissions you grant."
      },
      {
        "title": "Key Features Overview",
        "content": "*   **Dashboard:** At-a-glance view of your total Pi balance, mining rate, and active team members.\n*   **Balance Breakdown:** Detailed view of your Pi balance, including transferable, unverified, and locked-up amounts.\n*   **Balance Fluctuation Chart:** Visual representation of your balance changes over time.\n*   **Badge Showcase:** Display of earned badges within the Pi Network ecosystem (mocked).\n*   **Team Insights:** Information about your team members, their status, and contributions (mocked).\n*   **Node Analysis:** For node operators, metrics like uptime and performance score (mocked).\n*   **Settings:** Customize theme and language preferences."
      },
      {
        "title": "Troubleshooting Common Issues",
        "content": "*   **App not loading or showing errors:** As PiPulse currently uses mock data, persistent errors might indicate a problem with the application itself. Please try refreshing. If issues continue, contact support.\n*   **Data seems incorrect:** Remember, all data in this version is simulated. It does not reflect your actual Pi Network account."
      },
      {
        "title": "Contacting Support",
        "content": "If you have questions specific to the PiPulse application, encounter bugs, or have feedback, please email us at support@pipulse.example.com.\n\nFor any questions or issues regarding your actual Pi Network account, mining, KYC, or official Pi Network policies, please refer to the support channels provided by the Pi Network (e.g., in-app support in the official Pi app, official Pi Network website and community channels)."
      }
    ],
    "piosLicenseTitle": "PiOS License",
    "piosLicenseContent": "[Please copy the full PiOS License text here. This content will be displayed on the PiOS License page. Ensure proper markdown formatting for readability if the license text contains sections, paragraphs, or lists.]"
  },
  "dashboard": {
    "title": "Dashboard",
    "kpi_balance": "Total Pi Balance",
    "kpi_rate": "Current Mining Rate",
    "kpi_team": "Active Team Members",
    "balanceBreakdown": {
      "title": "Balance Breakdown",
      "transferableToMainnet": "Transferable to Mainnet",
      "fromYourTeamUnverified": "From Your Team (Unverified)",
      "currentlyInLockups": "Currently in Lockups",
      "disclaimer": "Note: Unverified Pi from team members requires them to complete KYC."
    },
    "unverifiedBalanceChart": {
      "title": "Balance Fluctuation",
      "yAxisLabel": "Pi Amount",
      "tooltipLabel": "Amount",
      "periods": {
        "threeMonths": "3M",
        "sixMonths": "6M",
        "twelveMonths": "12M"
      }
    },
    "myBadges": {
      "title": "My Badges",
      "earnedOn": "Earned on"
    }
  },
  "teamInsights": {
    "title": "Team Insights",
    "loading": "Loading team members...",
    "error": "Failed to load team members. Please try again.",
    "empty": "You have not invited any team members yet.",
    "columns": {
      "member": "Member",
      "joinDate": "Join Date",
      "status": "Status",
      "contribution": "Contribution"
    },
    "statusValues": {
      "active": "Active",
      "inactive": "Inactive",
      "pending": "Pending"
    },
    "contributionTooltip": "Unverified Pi contributed by this team member. Becomes transferable after they complete KYC."
  },
  "nodeAnalysis": {
    "title": "Node Analysis",
    "isOperator": {
      "uptime": "Node Uptime",
      "performanceScore": "Performance Score",
      "performanceHistory": "Performance History",
      "yAxisLabel": "Score"
    },
    "isNotOperator": {
      "title": "Become a Node Operator",
      "description": "Help secure the Pi Network and earn rewards by running a node. Click below to learn more and get started.",
      "button": "Learn More on Pi Network Official Site"
    }
  },
  "profile": {
    "title": "Edit Profile",
    "displayName": "Display Name",
    "bio": "Bio",
    "profilePicture": "Profile Picture",
    "saveButton": "Save Profile",
    "saving": "Saving...",
    "successToast": "Profile Saved!",
    "errorToast": "Save failed!"
  },
  "settings": {
    "title": "Application Settings",
    "theme": {
      "label": "Theme",
      "light": "Light",
      "dark": "Dark",
      "system": "System"
    },
    "language": {
      "label": "Language",
      "en": "English",
      "es": "Español"
    }
  },
  "shared": {
    "loading": "Loading...",
    "error": "An error occurred"
  },
  "dashboardError": {
    "title": "Something Went Wrong",
    "description": "We encountered an issue while loading this part of the dashboard. Please try again.",
    "detailsLabel": "Error details",
    "retryButton": "Try Again"
  }
}

    