
{
  "appName": "Vista Dinámica de Billetera Pi",
  "sidebar": {
    "dashboard": "Tablero",
    "team": "Perspectivas del Equipo",
    "node": "Análisis de Nodo",
    "profile": "Perfil",
    "settings": "Configuración",
    "logout": "Cerrar Sesión",
    "adPlaceholder": "Tu Anuncio Aquí",
    "help": "Ayuda"
  },
  "login": {
    "welcome": "Bienvenido a Vista Dinámica de Billetera Pi",
    "button": "Iniciar Sesión con Pi",
    "error": "Error al iniciar sesión. Por favor, inténtalo de nuevo."
  },
  "legal": {
    "termsTitle": "Términos de Servicio",
    "termsSections": [
      {
        "title": "Términos de Servicio - Introducción (Traducido)",
        "content": "Fecha de Vigencia: 26 de octubre de 2023\n\n¡Bienvenido a Vista Dinámica de Billetera Pi! Estos Términos de Servicio ('Términos') rigen tu uso de la aplicación Vista Dinámica de Billetera Pi y cualquier servicio relacionado (colectivamente, el 'Servicio'). Al acceder o utilizar nuestro Servicio, aceptas estar sujeto a estos Términos."
      },
      {
        "title": "1. Aceptación de los Términos (Traducido)",
        "content": "Al utilizar Vista Dinámica de Billetera Pi, confirmas que has leído, entendido y aceptado estos Términos. Si no estás de acuerdo con alguna parte de estos Términos, no debes utilizar el Servicio."
      },
      {
        "title": "2. Descripción del Servicio (Traducido)",
        "content": "Vista Dinámica de Billetera Pi es una aplicación de terceros diseñada para proporcionar a los usuarios un panel para ver sus métricas relacionadas con la Red Pi, incluyendo el saldo de Pi, la tasa de minería, información de miembros del equipo y rendimiento del nodo. Vista Dinámica de Billetera Pi no es una aplicación oficial de la Red Pi y no es una billetera. No almacena tus claves privadas ni facilita transacciones de Pi."
      },
      {
        "title": "3. Uso del Servicio (Traducido)",
        "content": "Aceptas utilizar el Servicio solo para los fines previstos y de conformidad con todas las leyes y regulaciones aplicables. Eres responsable de mantener la confidencialidad de cualquier información de cuenta relacionada con tu uso de la Red Pi al interactuar con cualquier aplicación de terceros."
      },
      {
        "title": "4. Exactitud de los Datos y Datos de Prueba (Traducido)",
        "content": "Actualmente, Vista Dinámica de Billetera Pi utiliza datos de prueba (mock data) para fines de demostración y desarrollo. En un entorno real conectado a la Red Pi, la exactitud de los datos mostrados dependería de la información disponible a través de las APIs de la Red Pi y los datos a los que autorices el acceso. Vista Dinámica de Billetera Pi no garantiza la exactitud absoluta o la puntualidad de los datos que se originan en la Red Pi."
      },
      {
        "title": "5. Descargo de Garantías (Traducido)",
        "content": "El Servicio se proporciona 'tal cual' y 'según esté disponible' sin ninguna garantía de ningún tipo, expresa o implícita. Vista Dinámica de Billetera Pi no garantiza que el Servicio sea ininterrumpido, libre de errores o completamente seguro. Vista Dinámica de Billetera Pi no está afiliado con el Equipo Central de Pi (Pi Core Team) ni con la Red Pi."
      },
      {
        "title": "6. Limitación de Responsabilidad (Traducido)",
        "content": "En la máxima medida permitida por la ley, Vista Dinámica de Billetera Pi no será responsable de ningún daño indirecto, incidental, especial, consecuente o punitivo, ni de ninguna pérdida de ganancias o ingresos, ya sea incurrida directa o indirectamente, ni de ninguna pérdida de datos, uso, fondo de comercio u otras pérdidas intangibles, resultantes de (a) tu acceso o uso o incapacidad para acceder o usar el Servicio; (b) cualquier conducta o contenido de cualquier tercero en el Servicio; o (c) acceso no autorizado, uso o alteración de tus transmisiones o contenido, incluso si Vista Dinámica de Billetera Pi ha sido advertido de la posibilidad de tales daños."
      },
      {
        "title": "7. Propiedad Intelectual (Traducido)",
        "content": "El nombre Vista Dinámica de Billetera Pi, el logotipo y todos los nombres, logotipos, nombres de productos y servicios, diseños y eslóganes relacionados son marcas comerciales de Vista Dinámica de Billetera Pi o sus licenciantes. Pi Network y el logotipo de Pi son marcas comerciales de Pi Community Company. Este Servicio no está respaldado ni afiliado a la Red Pi."
      },
      {
        "title": "8. Cambios en los Términos (Traducido)",
        "content": "Nos reservamos el derecho de modificar estos Términos en cualquier momento. Nos esforzaremos por notificar cualquier cambio significativo. Tu uso continuado del Servicio después de dichos cambios constituye tu aceptación de los nuevos Términos."
      },
      {
        "title": "9. Contáctanos (Traducido)",
        "content": "Si tienes alguna pregunta sobre estos Términos, por favor contáctanos en legal@example.com."
      }
    ],
    "privacyTitle": "Política de Privacidad",
    "privacySections": [
      {
        "title": "Política de Privacidad - Introducción (Traducido)",
        "content": "Fecha de Vigencia: 26 de octubre de 2023\n\nVista Dinámica de Billetera Pi ('nosotros', 'nos', o 'nuestro') se compromete a proteger tu privacidad. Esta Política de Privacidad explica cómo manejamos la información cuando utilizas nuestra aplicación Vista Dinámica de Billetera Pi (el 'Servicio')."
      },
      {
        "title": "1. Nuestra Relación con la Red Pi (Traducido)",
        "content": "Vista Dinámica de Billetera Pi es una aplicación independiente de terceros. NO es una aplicación oficial de la Red Pi ni del Equipo Central de Pi. Esta política describe el manejo de datos por parte de Vista Dinámica de Billetera Pi, no por la Red Pi en sí. Para conocer las prácticas de privacidad de la Red Pi, consulta su política de privacidad oficial."
      },
      {
        "title": "2. Información que Manejamos (Traducido)",
        "content": "Cuando utilizas Vista Dinámica de Billetera Pi, la aplicación está diseñada para mostrar información relacionada con tu cuenta de la Red Pi, que puede incluir:\n- Tu saldo de Pi y su desglose (por ejemplo, transferible, no verificado, bloqueos).\n- Tu tasa de minería de Pi actual.\n- Información sobre los miembros de tu equipo (por ejemplo, nombre, estado, contribución), según lo puedan poner a disposición las APIs de la Red Pi.\n- Datos de rendimiento del nodo (si eres un operador de nodo y estos datos son accesibles).\n- Información de perfil que puedas proporcionar directamente en Vista Dinámica de Billetera Pi (por ejemplo, nombre de usuario, biografía).\n\n**Nota Importante sobre la Versión Actual (Traducido):** La versión actual de Vista Dinámica de Billetera Pi utiliza DATOS DE PRUEBA (simulados) para todas sus funciones. No se establece ninguna conexión real con tu cuenta de la Red Pi, y Vista Dinámica de Billetera Pi no obtiene ni almacena datos reales de la Red Pi."
      },
      {
        "title": "3. Cómo Usaríamos la Información (Si Estuviera Conectada a Datos Reales) (Traducido)",
        "content": "Si Vista Dinámica de Billetera Pi estuviera conectado a datos reales de la Red Pi (lo cual no sucede actualmente), la información se utilizaría únicamente para:\n- Proporcionarte las funciones del panel: mostrar tus métricas relacionadas con Pi, perspectivas del equipo y análisis de nodos.\n- Permitirte personalizar tu experiencia en la aplicación (por ejemplo, tema, idioma).\nNo venderíamos tu información personal. El acceso a tus datos de la Red Pi requeriría tu autorización explícita a través de los mecanismos oficiales de la Red Pi."
      },
      {
        "title": "4. Almacenamiento y Seguridad de Datos (Traducido)",
        "content": "Vista Dinámica de Billetera Pi está diseñado como un visor o interfaz. No almacenaría datos sensibles de la Red Pi como claves privadas. Las preferencias de la aplicación (tema, idioma) se almacenan localmente en tu dispositivo. Si manejáramos datos reales, implementaríamos medidas de seguridad razonables para proteger la información mostrada."
      },
      {
        "title": "5. Servicios de Terceros y Publicidad (Traducido)",
        "content": "Vista Dinámica de Billetera Pi no comparte tus datos específicos de la Red Pi con anunciantes externos. La aplicación puede contener elementos de marcador de posición para anuncios que no son funcionales en la versión de prueba actual y no te rastrean."
      },
      {
        "title": "6. Tus Opciones y Derechos (Traducido)",
        "content": "El control sobre tus datos de la Red Pi reside en tu cuenta de la Red Pi y su plataforma oficial. Vista Dinámica de Billetera Pi, como visor de terceros, solo mostraría datos basados en los permisos que otorgues a través de la Red Pi. La información de perfil ingresada directamente en Vista Dinámica de Billetera Pi puede ser gestionada por ti dentro de la aplicación."
      },
      {
        "title": "7. Privacidad de los Niños (Traducido)",
        "content": "Vista Dinámica de Billetera Pi no está destinado al uso por parte de niños menores de 13 años (o la edad pertinente en tu jurisdicción). No recopilamos conscientemente información personal de niños."
      },
      {
        "title": "8. Cambios a Esta Política de Privacidad (Traducido)",
        "content": "Podemos actualizar esta Política de Privacidad de vez en cuando. Te notificaremos cualquier cambio significativo publicando la nueva Política de Privacidad dentro de la aplicación o en nuestro sitio web."
      },
      {
        "title": "9. Contáctanos (Traducido)",
        "content": "Si tienes alguna pregunta sobre esta Política de Privacidad, por favor contáctanos en privacy@example.com."
      }
    ],
    "returnToLogin": "Volver al Inicio de Sesión",
    "returnAction": "Volver",
    "helpTitle": "Ayuda y Soporte",
    "helpSections": [
      {
        "title": "¡Bienvenido a Ayuda y Soporte! (Traducido)",
        "content": "**¿Qué es Vista Dinámica de Billetera Pi? (Traducido)**\nVista Dinámica de Billetera Pi es una aplicación de terceros diseñada para ofrecer una interfaz dinámica y fácil de usar para ver tus métricas relacionadas con la Red Pi. Esto incluye tu saldo de Pi, la tasa de minería actual, información sobre la actividad de tu equipo y datos de rendimiento si operas un Nodo Pi."
      },
      {
        "title": "¿Es Vista Dinámica de Billetera Pi una Aplicación Oficial de la Red Pi? (Traducido)",
        "content": "No, Vista Dinámica de Billetera Pi es una aplicación independiente desarrollada por entusiastas. No está oficialmente afiliada, respaldada ni patrocinada por el Equipo Central de Pi (Pi Core Team) ni por la Red Pi."
      },
      {
        "title": "¿Cuán precisos son los datos que se muestran en Vista Dinámica de Billetera Pi? (Traducido)",
        "content": "Actualmente, Vista Dinámica de Billetera Pi utiliza DATOS DE PRUEBA (SIMULADOS) para todas sus funciones. Esto es para fines de demostración y desarrollo. En una futura versión destinada al uso real, la precisión de los datos dependería de la información proporcionada por las APIs oficiales de la Red Pi y los permisos que otorgues."
      },
      {
        "title": "Descripción General de las Funciones Clave: (Traducido)",
        "content": "*   **Tablero:** Vista rápida de tu saldo total de Pi, tasa de minería y miembros activos del equipo.\n*   **Desglose de Saldo:** Vista detallada de tu saldo de Pi, incluyendo cantidades transferibles, no verificadas y bloqueadas.\n*   **Gráfico de Fluctuación de Saldo:** Representación visual de los cambios de tu saldo a lo largo del tiempo.\n*   **Muestra de Insignias:** Visualización de insignias obtenidas dentro del ecosistema de la Red Pi (simulado).\n*   **Perspectivas del Equipo:** Información sobre los miembros de tu equipo, su estado y contribuciones (simulado).\n*   **Análisis de Nodo:** Para operadores de nodos, métricas como tiempo de actividad y puntuación de rendimiento (simulado).\n*   **Configuración:** Personaliza las preferencias de tema e idioma."
      },
      {
        "title": "Solución de Problemas Comunes: (Traducido)",
        "content": "*   **La aplicación no carga o muestra errores:** Dado que Vista Dinámica de Billetera Pi actualmente utiliza datos de prueba, los errores persistentes podrían indicar un problema con la aplicación misma. Intenta actualizar. Si los problemas continúan, contacta al soporte.\n*   **Los datos parecen incorrectos:** Recuerda, todos los datos en esta versión son simulados. No reflejan tu cuenta real de la Red Pi."
      },
      {
        "title": "Contactar al Soporte: (Traducido)",
        "content": "Si tienes preguntas específicas sobre la aplicación Vista Dinámica de Billetera Pi, encuentras errores o tienes comentarios, por favor envíanos un correo electrónico a support@example.com.\n\nPara cualquier pregunta o problema relacionado con tu cuenta real de la Red Pi, minería, KYC o políticas oficiales de la Red Pi, consulta los canales de soporte proporcionados por la Red Pi (por ejemplo, soporte dentro de la aplicación oficial de Pi, sitio web oficial de la Red Pi y canales comunitarios)."
      }
    ]
  },
  "dashboard": {
    "title": "Tablero",
    "kpi_balance": "Saldo Total de Pi",
    "kpi_rate": "Tasa de Minería Actual",
    "kpi_team": "Miembros Activos del Equipo",
    "balanceBreakdown": {
      "title": "Desglose de Saldo",
      "transferableToMainnet": "Transferible a Mainnet",
      "fromYourTeamUnverified": "De tu Equipo (No Verificado)",
      "currentlyInLockups": "Actualmente en Bloqueos",
      "disclaimer": "Nota: El Pi no verificado de los miembros del equipo requiere que completen KYC. (Traducido)"
    },
    "unverifiedBalanceChart": {
      "title": "Fluctuación de Saldo",
      "yAxisLabel": "Cantidad de Pi",
      "tooltipLabel": "Cantidad",
      "periods": {
        "threeMonths": "3M",
        "sixMonths": "6M",
        "twelveMonths": "12M"
      }
    },
    "myBadges": {
      "title": "Mis Insignias",
      "earnedOn": "Obtenido el"
    },
    "miningFocus": {
      "title": "Enfoque de Minería",
      "description": "¡Sigue tus metas de minería personales y mantente motivado!",
      "weeklyGoal": "Meta Semanal",
      "monthlyGoal": "Meta Mensual",
      "goalAchieved": "¡Meta Alcanzada!",
      "keepGoing": "¡Sigue así!",
      "greatProgress": "¡Gran progreso!",
      "teamEncouragement": "¡Anima a tu equipo a mantenerse activo! Sus contribuciones ayudan a crecer la red."
    },
    "teamActivity": {
      "title": "Rally de Minería del Equipo",
      "yourActivity": "Tu Actividad",
      "lastWeek": "Semana Pasada",
      "lastMonth": "Mes Pasado",
      "hoursSuffix": "hrs",
      "teamRallyWeekly": "Rally Semanal del Equipo",
      "teamRallyTop10": "Rally Semanal del Equipo (Top 10)",
      "rank": "Rango",
      "member": "Miembro",
      "hours": "Horas",
      "yourRank": "Tu Rango: #{{rank}} ({{hours}} hrs)",
      "viewFullTeamReport": "Ver Informe Completo del Equipo",
      "newlyEarnedBadges": "Logros Recientes",
      "noTeamMembers": "Aún no hay miembros en el equipo para mostrar actividad.",
      "noActivity": "No hay datos de actividad para mostrar para el equipo."
    }
  },
  "teamInsights": {
    "title": "Perspectivas del Equipo",
    "loading": "Cargando miembros del equipo...",
    "error": "Error al cargar los miembros del equipo. Por favor, inténtalo de nuevo.",
    "empty": "Aún no has invitado a ningún miembro al equipo.",
    "columns": {
      "member": "Miembro",
      "joinDate": "Fecha de Unión",
      "status": "Estado",
      "contribution": "Contribución",
      "activityLastWeek": "Actividad (Semana Pasada)",
      "activityLastMonth": "Actividad (Mes Pasado)"
    },
    "statusValues": {
      "active": "Activo",
      "inactive": "Inactivo",
      "pending": "Pendiente"
    },
    "contributionTooltip": "Pi no verificado contribuido por este miembro del equipo. Se vuelve transferible después de que completen KYC. (Traducido)"
  },
  "nodeAnalysis": {
    "title": "Análisis de Nodo",
    "isOperator": {
      "uptime": "Tiempo de Actividad del Nodo",
      "performanceScore": "Puntuación de Rendimiento",
      "performanceHistory": "Historial de Rendimiento",
      "yAxisLabel": "Puntuación"
    },
    "isNotOperator": {
      "title": "Conviértete en un Operador de Nodo",
      "description": "Ayuda a asegurar la Red Pi y gana recompensas ejecutando un nodo. Haz clic a continuación para obtener más información y comenzar. (Traducido)",
      "button": "Más Información en el Sitio Oficial de Pi Network"
    }
  },
  "profile": {
    "title": "Editar Perfil",
    "displayName": "Nombre para Mostrar",
    "bio": "Biografía",
    "profilePicture": "Foto de Perfil",
    "saveButton": "Guardar Perfil",
    "saving": "Guardando...",
    "successToast": "¡Perfil Guardado!",
    "errorToast": "¡Error al guardar!"
  },
  "settings": {
    "title": "Configuración de la Aplicación",
    "theme": {
      "label": "Tema",
      "light": "Claro",
      "dark": "Oscuro",
      "system": "Sistema"
    },
    "language": {
      "label": "Idioma",
      "en": "Inglés",
      "es": "Español"
    }
  },
  "shared": {
    "loading": "Cargando...",
    "error": "Ocurrió un error"
  },
  "dashboardError": {
    "title": "Algo Salió Mal",
    "description": "Encontramos un problema al cargar esta parte del tablero. Por favor, inténtalo de nuevo.",
    "detailsLabel": "Detalles del error",
    "retryButton": "Intentar de Nuevo"
  }
}
