
{
  "appName": "PiPulse",
  "sidebar": {
    "dashboard": "Tableau de bord",
    "team": "Aperçus de l'équipe",
    "node": "Analyse des nœuds",
    "chat": "Chat d'équipe",
    "profile": "Profil",
    "settings": "Paramètres",
    "logout": "Déconnexion",
    "adPlaceholder": "Votre publicité ici",
    "help": "Aide",
    "chatRedirect": {
      "title": "Ouvrir le Chat d'Équipe ?",
      "description": "Vous êtes sur le point d'être redirigé vers le Chat officiel de l'Équipe Pi dans un nouvel onglet. Voulez-vous continuer ?",
      "confirmButton": "Ouvrir le Chat",
      "cancelButton": "Annuler"
    },
    "logoutConfirm": {
      "title": "Confirmer la Déconnexion",
      "description": "Êtes-vous sûr de vouloir vous déconnecter ? Vous devrez vous ré-authentifier avec votre compte Pi Network pour vous reconnecter.",
      "confirmButton": "Déconnexion",
      "cancelButton": "Annuler"
    }
  },
  "login": {
    "welcome": "Bienvenue sur PiPulse",
    "button": "Se connecter avec Pi",
    "error": "Échec de la connexion. Veuillez réessayer.",
    "piAuthInfo": "Cela vous authentifiera en utilisant votre compte Pi Network.",
    "deviceLogin": {
      "button": "Se connecter avec l'appareil",
      "placeholderTitle": "Connexion avec l'appareil (Bientôt disponible)",
      "placeholderDescription": "Cette fonctionnalité vous permettra de vous connecter rapidement en utilisant les données biométriques de votre appareil après la configuration initiale. Pas encore implémenté."
    }
  },
  "legal": {
    "termsTitle": "Conditions d'utilisation",
    "termsSections": [
      {
        "title": "Conditions d'utilisation - Introduction",
        "content": "Date d'entrée en vigueur : 26 octobre 2023\n\nBienvenue sur PiPulse ! Ces Conditions d'utilisation ('Conditions') régissent votre utilisation de l'application PiPulse et de tous les services associés (collectivement, le 'Service'). En accédant ou en utilisant notre Service, vous acceptez d'être lié par ces Conditions."
      },
      {
        "title": "1. Acceptation des Conditions",
        "content": "En utilisant PiPulse, vous confirmez avoir lu, compris et accepté ces Conditions. Si vous n'êtes pas d'accord avec une partie de ces Conditions, vous ne devez pas utiliser le Service."
      },
      {
        "title": "2. Description du Service",
        "content": "PiPulse est une application tierce conçue pour fournir aux utilisateurs un tableau de bord pour visualiser leurs métriques liées au Réseau Pi, y compris le solde Pi, le taux de minage, les informations des membres de l'équipe et les performances des nœuds. PiPulse n'est pas une application officielle du Réseau Pi et n'est pas un portefeuille. Elle ne stocke pas vos clés privées ni ne facilite les transactions Pi."
      },
      {
        "title": "3. Utilisation du Service",
        "content": "Vous acceptez d'utiliser le Service uniquement aux fins prévues et conformément à toutes les lois et réglementations applicables. Vous êtes responsable du maintien de la confidentialité de toute information de compte liée à votre utilisation du Réseau Pi lors de l'interaction avec toute application tierce."
      },
      {
        "title": "4. Exactitude des Données et Données Fictives",
        "content": "Actuellement, PiPulse utilise des données fictives à des fins de démonstration et de développement. Dans un environnement réel connecté au Réseau Pi, l'exactitude des données affichées dépendrait des informations mises à disposition par les API du Réseau Pi et des données auxquelles vous autorisez l'accès. PiPulse ne garantit pas l'exactitude absolue ou l'actualité des données provenant du Réseau Pi."
      },
      {
        "title": "5. Exclusion de Garanties",
        "content": "Le Service est fourni 'tel quel' et 'tel que disponible' sans aucune garantie d'aucune sorte, expresse ou implicite. PiPulse ne garantit pas que le Service sera ininterrompu, sans erreur ou complètement sécurisé. PiPulse n'est pas affilié à l'Équipe Centrale Pi (Pi Core Team) ni au Réseau Pi."
      },
      {
        "title": "6. Limitation de Responsabilité",
        "content": "Dans toute la mesure permise par la loi, PiPulse ne sera pas responsable des dommages indirects, accessoires, spéciaux, consécutifs ou punitifs, ni de toute perte de profits ou de revenus, qu'ils soient encourus directement ou indirectement, ni de toute perte de données, d'utilisation, de clientèle ou d'autres pertes immatérielles, résultant de (a) votre accès ou utilisation ou incapacité d'accéder ou d'utiliser le Service ; (b) toute conduite ou contenu de tout tiers sur le Service ; ou (c) l'accès, l'utilisation ou l'altération non autorisés de vos transmissions ou contenus, même si PiPulse a été informé de la possibilité de tels dommages."
      },
      {
        "title": "7. Propriété Intellectuelle",
        "content": "Le nom PiPulse, le logo et tous les noms, logos, noms de produits et services, conceptions et slogans associés sont des marques commerciales de PiPulse ou de ses concédants de licence. Pi Network et le logo Pi sont des marques commerciales de Pi Community Company. Ce Service n'est ni approuvé ni affilié au Réseau Pi."
      },
      {
        "title": "8. Modifications des Conditions",
        "content": "Nous nous réservons le droit de modifier ces Conditions à tout moment. Nous nous efforcerons de notifier tout changement significatif. Votre utilisation continue du Service après de tels changements constitue votre acceptation des nouvelles Conditions."
      },
      {
        "title": "9. Nous Contacter",
        "content": "Si vous avez des questions concernant ces Conditions, veuillez nous contacter à legal@example.com."
      }
    ],
    "privacyTitle": "Politique de Confidentialité",
    "privacySections": [
      {
        "title": "Politique de Confidentialité - Introduction",
        "content": "Date d'entrée en vigueur : 26 octobre 2023\n\nPiPulse ('nous', 'notre' ou 'nos') s'engage à proteger votre vie privée. Cette Politique de Confidentialité explique comment nous traitons les informations lorsque vous utilisez notre application PiPulse (le 'Service')."
      },
      {
        "title": "1. Notre Relation avec le Réseau Pi",
        "content": "PiPulse est une application tierce indépendante. Ce N'EST PAS une application officielle du Réseau Pi ou de l'Équipe Centrale Pi. Cette politique décrit le traitement des données par PiPulse, et non par le Réseau Pi lui-même. Pour les pratiques de confidentialité du Réseau Pi, veuillez consulter leur politique de confidentialité officielle."
      },
      {
        "title": "2. Informations que Nous Traitons",
        "content": "Lorsque vous utilisez PiPulse, l'application est conçue pour afficher des informations relatives à votre compte Réseau Pi, qui peuvent inclure :\n- Votre solde Pi et sa répartition (par exemple, transférable, non vérifié, verrouillages).\n- Votre taux de minage Pi actuel.\n- Des informations sur les membres de votre équipe (par exemple, nom, statut, contribution), telles que potentiellement mises à disposition par les API du Réseau Pi.\n- Données de performance des nœuds (si vous êtes un opérateur de nœud et que ces données sont accessibles).\n- Informations de profil que vous pourriez fournir directement dans PiPulse (par exemple, nom d'affichage, biographie).\n\n**Note Importante sur la Version Actuelle :** La version actuelle de PiPulse utilise des DONNÉES FICTIVES (simulées) pour toutes ses fonctionnalités. Aucune connexion réelle à votre compte Réseau Pi n'est établie, et aucune donnée réelle du Réseau Pi n'est récupérée ou stockée par PiPulse."
      },
      {
        "title": "3. Comment Nous Utiliserions les Informations (Si Connectées à des Données Réelles)",
        "content": "Si PiPulse était connecté à des données réelles du Réseau Pi (ce qui n'est actuellement pas le cas), les informations seraient utilisées uniquement pour :\n- Vous fournir les fonctionnalités du tableau de bord : affichage de vos métriques liées à Pi, aperçus de l'équipe et analyse des nœuds.\n- Vous permettre de personnaliser votre expérience applicative (par exemple, thème, langue).\nNous ne vendrions pas vos informations personnelles. L'accès à vos données du Réseau Pi nécessiterait votre autorisation explicite via les mécanismes officiels du Réseau Pi."
      },
      {
        "title": "4. Stockage et Sécurité des Données",
        "content": "PiPulse est conçu comme un visualiseur ou une interface. Il ne stockerait pas de données sensibles du Réseau Pi comme les clés privées. Les préférences de l'application (thème, langue) sont stockées localement sur votre appareil. Si nous traitions des données réelles, nous mettrions en œuvre des mesures de sécurité raisonnables pour protéger les informations affichées."
      },
      {
        "title": "5. Services Tiers et Publicités",
        "content": "PiPulse ne partage pas vos données spécifiques au Réseau Pi avec des annonceurs tiers. L'application peut contenir des éléments de remplacement pour des publicités qui ne sont pas fonctionnels dans la version fictive actuelle et ne vous suivent pas."
      },
      {
        "title": "6. Vos Choix et Droits",
        "content": "Le contrôle de vos données du Réseau Pi réside dans votre compte Réseau Pi et sa plateforme officielle. PiPulse, en tant que visualiseur tiers, n'afficherait des données qu'en fonction des autorisations que vous accordez via le Réseau Pi. Les informations de profil saisies directement dans PiPulse peuvent être gérées par vous au sein de l'application."
      },
      {
        "title": "7. Confidentialité des Enfants",
        "content": "PiPulse n'est pas destiné à être utilisé par des enfants de moins de 13 ans (ou l'âge pertinent dans votre juridiction). Nous ne collectons pas sciemment d'informations personnelles auprès des enfants."
      },
      {
        "title": "8. Modifications de cette Politique de Confidentialité",
        "content": "Nous pouvons mettre à jour cette Politique de Confidentialité de temps à autre. Nous vous informerons de tout changement significatif en publiant la nouvelle Politique de Confidentialité dans l'application ou sur notre site Web."
      },
      {
        "title": "9. Nous Contacter",
        "content": "Si vous avez des questions concernant cette Politique de Confidentialité, veuillez nous contacter à privacy@example.com."
      }
    ],
    "returnToLogin": "Retour à la connexion",
    "returnAction": "Retour",
    "helpTitle": "Aide et Support",
    "helpSections": [
      {
        "title": "Bienvenue à l'Aide et Support !",
        "content": "**Qu'est-ce que PiPulse ?**\nPiPulse est une application tierce conçue pour offrir une interface dynamique et conviviale pour visualiser vos métriques liées au Réseau Pi. Cela inclut votre solde Pi, votre taux de minage actuel, des aperçus de l'activité de votre équipe et des données de performance si vous exploitez un Nœud Pi."
      },
      {
        "title": "PiPulse est-elle une application officielle du Réseau Pi ?",
        "content": "Non, PiPulse est une application indépendante développée par des passionnés. Elle n'est officiellement affiliée, approuvée ou sponsorisée ni par l'Équipe Centrale Pi (Pi Core Team) ni par le Réseau Pi."
      },
      {
        "title": "Quelle est la précision des données affichées dans PiPulse ?",
        "content": "Actuellement, PiPulse utilise des DONNÉES FICTIVES (SIMULÉES) pour toutes ses fonctionnalités. Ceci à des fins de démonstration et de développement. Dans une future version destinée à une utilisation réelle, la précision des données dépendrait des informations fournies par les API officielles du Réseau Pi et des autorisations que vous accordez."
      },
      {
        "title": "Aperçu des Fonctionnalités Clés",
        "content": "*   **Tableau de bord :** Vue d'ensemble de votre solde Pi total, de votre taux de minage et des membres actifs de votre équipe.\n*   **Répartition du Solde :** Vue détaillée de votre solde Pi, y compris les montants transférables, non vérifiés et verrouillés.\n*   **Graphique de Fluctuation du Solde :** Représentation visuelle de l'évolution de votre solde dans le temps.\n*   **Vitrine des Badges :** Affichage des badges gagnés au sein de l'écosystème du Réseau Pi (fictif).\n*   **Aperçus de l'Équipe :** Informations sur les membres de votre équipe, leur statut et leurs contributions (fictif).\n*   **Analyse des Nœuds :** Pour les opérateurs de nœuds, des métriques comme le temps de disponibilité et le score de performance (fictif).\n*   **Paramètres :** Personnalisez les préférences de thème et de langue."
      },
      {
        "title": "Dépannage des Problèmes Courants",
        "content": "*   **L'application ne se charge pas ou affiche des erreurs :** Comme PiPulse utilise actuellement des données fictives, des erreurs persistantes pourraient indiquer un problème avec l'application elle-même. Veuillez essayer de rafraîchir. Si les problèmes persistent, contactez le support.\n*   **Les données semblent incorrectes :** N'oubliez pas que toutes les données de cette version sont simulées. Elles ne reflètent pas votre compte Réseau Pi réel."
      },
      {
        "title": "Contacter le Support",
        "content": "Si vous avez des questions spécifiques à l'application PiPulse, rencontrez des bugs ou avez des commentaires, veuillez nous envoyer un e-mail à support@example.com.\n\nPour toute question ou problème concernant votre compte Réseau Pi réel, le minage, le KYC ou les politiques officielles du Réseau Pi, veuillez vous référer aux canaux de support fournis par le Réseau Pi (par exemple, support intégré à l'application officielle Pi, site Web officiel du Réseau Pi et canaux communautaires)."
      }
    ],
    "piosLicenseTitle": "Licence PiOS",
    "piosLicenseContent": "La Licence Open Source Pi (PiOS) permet aux développeurs de la communauté Pi de créer des applications et des outils Pi pour l'écosystème Pi. Les développeurs sont libres d'utiliser la licence pour s'appuyer sur le travail d'autrui et pour que leurs créations soient utilisées et développées par d'autres au sein de l'écosystème Pi.\n\nLa licence PiOS accorde une utilisation illimitée du logiciel uniquement au sein de l'écosystème Pi. La vente du logiciel, ou de tout logiciel incorporant un logiciel sous licence PiOS ou ses dérivés, contre de la monnaie fiduciaire est interdite. La vente contre la crypto-monnaie Pi est autorisée. La licence interdit également explicitement l'utilisation du logiciel pour créer tout produit qui pourrait être considéré comme concurrent de Pi Network.\n\nLisez la licence complète [ici](https://github.com/pi-apps/PiOS/blob/main/LICENSE.md).",
    "acceptTerms": {
      "title": "Consultez Nos Conditions",
      "description": "Avant de continuer, veuillez consulter et accepter nos Conditions d'utilisation et notre Politique de confidentialité.",
      "message": "En cliquant sur 'J'accepte et je continue', vous reconnaissez avoir lu, compris et accepté d'être lié par nos Conditions d'utilisation et notre Politique de confidentialité. Vous pouvez consulter ces documents en cliquant sur les liens ci-dessous.",
      "acceptButton": "J'accepte et je continue",
      "logoutButton": "Déconnexion"
    }
  },
  "dashboard": {
    "title": "Tableau de bord",
    "kpi_balance": "Solde Pi Total",
    "kpi_rate": "Taux de Minage Actuel",
    "kpi_team": "Membres Actifs de l'Équipe",
    "kpi_node_uptime": "Temps de fonctionnement du nœud",
    "balanceBreakdown": {
      "title": "Répartition du Solde",
      "transferableToMainnet": "Transférable vers Mainnet",
      "totalUnverifiedPi": "Pi Total Non Vérifié",
      "currentlyInLockups": "Actuellement en Verrouillage",
      "disclaimer": "Note : Le Pi non vérifié nécessite que les membres associés complètent le KYC pour devenir transférable."
    },
    "unverifiedPiDetail": {
      "title": "Sources de Pi Non Vérifié",
      "fromReferralTeam": "De l'Équipe de Parrainage",
      "fromSecurityCircle": "Du Cercle de Sécurité",
      "fromNodeRewards": "Des Récompenses de Nœud",
      "fromOtherBonuses": "D'Autres Bonus",
      "disclaimer": "Ces montants deviennent transférables à mesure que vos connexions complètent le KYC ou que d'autres conditions sont remplies."
    },
    "unverifiedBalanceChart": {
      "title": "Fluctuation du Solde",
      "yAxisLabel": "Montant Pi",
      "tooltipLabel": "Montant",
      "tooltipLabelTransferable": "Transférable",
      "tooltipLabelUnverified": "Non Vérifié",
      "periods": {
        "threeMonths": "3M",
        "sixMonths": "6M",
        "twelveMonths": "12M"
      }
    },
    "myBadges": {
      "title": "Mes Badges",
      "earnedOn": "Gagné le"
    },
    "miningFocus": {
      "title": "Focus Minage",
      "description": "Suivez vos objectifs de minage personnels et restez motivé !",
      "weeklyGoal": "Objectif Hebdomadaire (Jours)",
      "monthlyGoal": "Objectif Mensuel (Jours)",
      "daysSuffix": "jours",
      "goalAchieved": "Objectif Atteint !",
      "keepGoing": "Continuez votre excellent travail !",
      "greatProgress": "Vous faites de grands progrès !",
      "teamEncouragement": "Encouragez votre équipe à rester active ! Leurs contributions aident le réseau à se développer."
    },
    "teamActivity": {
      "title": "Rallye de Minage d'Équipe",
      "yourActivity": "Votre Activité",
      "lastWeek": "Semaine Dernière",
      "lastMonth": "Mois Dernier",
      "hoursSuffix": "h",
      "teamRallyWeekly": "Rallye d'Équipe Hebdomadaire",
      "teamRallyTop10": "Rallye d'Équipe Hebdomadaire (Top 10)",
      "rank": "Rang",
      "member": "Membre",
      "hours": "Heures",
      "yourRank": "Votre Rang : #{{rank}} ({{hours}} h)",
      "viewFullTeamReport": "Voir le Rapport Complet de l'Équipe",
      "newlyEarnedBadges": "Succès Récents",
      "noTeamMembers": "Aucun membre d'équipe à afficher pour l'activité pour le moment.",
      "noActivity": "Aucune donnée d'activité à afficher pour l'équipe."
    },
    "miningRateRedirect": {
      "title": "Rediriger vers l'application Pi ?",
      "description": "Vous allez être redirigé vers l'application Pi Network pour gérer votre session de minage. Continuer ?",
      "confirmButton": "Continuer vers l'application Pi",
      "cancelButton": "Annuler"
    }
  },
  "teamInsights": {
    "title": "Aperçus de l'équipe",
    "loading": "Chargement des membres de l'équipe...",
    "error": "Échec du chargement des membres de l'équipe. Veuillez réessayer.",
    "empty": "Vous n'avez encore invité aucun membre dans l'équipe.",
    "columns": {
      "member": "Membre",
      "joinDate": "Date d'adhésion",
      "status": "Statut",
      "contribution": "Contribution",
      "activityLastWeek": "Activité (Semaine dernière)",
      "activityLastMonth": "Activité (Mois dernier)",
      "kycStatus": "Statut KYC"
    },
    "statusValues": {
      "active": "Actif",
      "inactive": "Inactif",
      "pending": "En attente"
    },
    "kycStatusValues": {
      "completed": "Terminé",
      "pending": "En attente",
      "not_completed": "Non terminé"
    },
    "contributionTooltip": "Pi non vérifié contribué par ce membre de l'équipe. Devient transférable après qu'il a complété le KYC."
  },
  "nodeAnalysis": {
    "title": "Analyse des nœuds",
    "isOperator": {
      "uptime": "Temps de disponibilité du nœud",
      "performanceScore": "Score de performance",
      "performanceHistory": "Historique des performances",
      "yAxisLabel": "Score"
    },
    "isNotOperator": {
      "title": "Devenez un opérateur de nœud",
      "description": "Aidez à sécuriser le Réseau Pi et gagnez des récompenses en exécutant un nœud. Cliquez ci-dessous pour en savoir plus et commencer.",
      "button": "En savoir plus sur le site officiel du Réseau Pi"
    }
  },
  "profile": {
    "title": "Modifier le profil",
    "displayName": "Nom d'affichage",
    "bio": "Bio",
    "profilePicture": "Photo de profil",
    "saveButton": "Enregistrer le profil",
    "saving": "Enregistrement...",
    "successToast": "Profil enregistré !",
    "errorToast": "Échec de l'enregistrement !"
  },
  "settings": {
    "title": "Paramètres de l'application",
    "theme": {
      "label": "Thème",
      "light": "Clair",
      "dark": "Sombre",
      "system": "Système"
    },
    "language": {
      "label": "Langue",
      "en": "Anglais",
      "es": "Espagnol",
      "fr": "Français",
      "ru": "Russe",
      "pt": "Portugais",
      "ja": "Japonais",
      "zh": "Chinois"
    },
    "security": {
        "title": "Paramètres de sécurité",
        "deviceLogin": {
            "label": "Activer la connexion rapide avec l'appareil",
            "description": "Utilisez les données biométriques ou le verrouillage de l'écran de votre appareil pour une connexion plus rapide.",
            "note": "Cette fonctionnalité est une simulation. La véritable connexion biométrique n'est pas implémentée."
        }
    }
  },
  "shared": {
    "loading": "Chargement...",
    "error": "Une erreur est survenue"
  },
  "dashboardError": {
    "title": "Quelque chose s'est mal passé",
    "description": "Nous avons rencontré un problème lors du chargement de cette partie du tableau de bord. Veuillez réessayer.",
    "detailsLabel": "Détails de l'erreur",
    "retryButton": "Réessayer"
  }
}
