
{
  "appName": "Visualização Dinâmica da Carteira Pi",
  "sidebar": {
    "dashboard": "Painel",
    "team": "Informações da Equipe",
    "node": "Análise de Nó",
    "profile": "Perfil",
    "settings": "Configurações",
    "logout": "Sair",
    "adPlaceholder": "Seu Anúncio Aqui",
    "help": "Ajuda"
  },
  "login": {
    "welcome": "Bem-vindo à Visualização Dinâmica da Carteira Pi",
    "button": "Login com Pi",
    "error": "Falha no login. Por favor, tente novamente."
  },
  "legal": {
    "termsTitle": "Termos de Serviço",
    "termsSections": [
      {
        "title": "Termos de Serviço - Introdução",
        "content": "Data de Vigência: 26 de outubro de 2023\n\nBem-vindo à Visualização Dinâmica da Carteira Pi! Estes Termos de Serviço ('Termos') regem o seu uso do aplicativo Visualização Dinâmica da Carteira Pi e quaisquer serviços relacionados (coletivamente, o 'Serviço'). Ao acessar ou usar nosso Serviço, você concorda em ficar vinculado a estes Termos."
      },
      {
        "title": "1. Aceitação dos Termos",
        "content": "Ao usar a Visualização Dinâmica da Carteira Pi, você confirma que leu, entendeu e concorda com estes Termos. Se você não concorda com qualquer parte destes Termos, você не deve usar o Serviço."
      },
      {
        "title": "2. Descrição do Serviço",
        "content": "A Visualização Dinâmica da Carteira Pi é um aplicativo de terceiros projetado para fornecer aos usuários um painel para visualizar suas métricas relacionadas à Rede Pi, incluindo saldo de Pi, taxa de mineração, informações de membros da equipe e desempenho do nó. A Visualização Dinâmica da Carteira Pi não é um aplicativo oficial da Rede Pi e não é uma carteira. Ele não armazena suas chaves privadas nem facilita transações de Pi."
      },
      {
        "title": "3. Uso do Serviço",
        "content": "Você concorda em usar o Serviço apenas para os fins pretendidos e de acordo com todas as leis e regulamentos aplicáveis. Você é responsável por manter a confidencialidade de qualquer informação da conta relacionada ao seu uso da Rede Pi ao interagir com qualquer aplicativo de terceiros."
      },
      {
        "title": "4. Precisão dos Dados e Dados Fictícios",
        "content": "Atualmente, a Visualização Dinâmica da Carteira Pi utiliza dados fictícios (mock data) для fins de demonstração e desenvolvimento. Em um ambiente ativo conectado à Rede Pi, a precisão dos dados exibidos dependeria das informações disponibilizadas pelas APIs da Rede Pi e dos dados aos quais você autoriza o acesso. A Visualização Dinâmica da Carteira Pi não garante a precisão absoluta ou a pontualidade dos dados originados da Rede Pi."
      },
      {
        "title": "5. Isenção de Garantias",
        "content": "O Serviço é fornecido 'como está' e 'conforme disponível' sem quaisquer garantias de qualquer tipo, expressas ou implícitas. A Visualização Dinâmica da Carteira Pi não garante que o Serviço será ininterrupto, livre de erros ou completamente seguro. A Visualização Dinâmica da Carteira Pi não é afiliada à Equipe Principal Pi (Pi Core Team) ou à Rede Pi."
      },
      {
        "title": "6. Limitação de Responsabilidade",
        "content": "Na extensão máxima permitida por lei, a Visualização Dinâmica da Carteira Pi não será responsável por quaisquer danos indiretos, incidentais, especiais, consequenciais ou punitivos, ou qualquer perda de lucros ou receitas, incorridos direta ou indiretamente, ou qualquer perda de dados, uso, fundo de comércio ou outras perdas intangíveis, resultantes de (a) seu acesso ou uso ou incapacidade de acessar ou usar o Serviço; (b) qualquer conduta ou conteúdo de terceiros no Serviço; ou (c) acesso, uso ou alteração não autorizados de suas transmissões ou conteúdo, mesmo que a Visualização Dinâmica da Carteira Pi tenha sido avisada da possibilidade de tais danos."
      },
      {
        "title": "7. Propriedade Intelectual",
        "content": "O nome Visualização Dinâmica da Carteira Pi, o logotipo e todos os nomes, logotipos, nomes de produtos e serviços, designs e slogans relacionados são marcas comerciais da Visualização Dinâmica da Carteira Pi ou de seus licenciadores. Pi Network e o logotipo Pi são marcas comerciais da Pi Community Company. Este Serviço não é endossado ou afiliado à Rede Pi."
      },
      {
        "title": "8. Alterações nos Termos",
        "content": "Reservamo-nos o direito de modificar estes Termos a qualquer momento. Envidaremos esforços para notificar sobre quaisquer alterações significativas. Seu uso continuado do Serviço após tais alterações constitui sua aceitação dos novos Termos."
      },
      {
        "title": "9. Contate-Nos",
        "content": "Se você tiver alguma dúvida sobre estes Termos, entre em contato conosco em legal@example.com."
      }
    ],
    "privacyTitle": "Política de Privacidade",
    "privacySections": [
      {
        "title": "Política de Privacidade - Introdução",
        "content": "Data de Vigência: 26 de outubro de 2023\n\nA Visualização Dinâmica da Carteira Pi ('nós', 'nos' ou 'nosso') está comprometida em proteger sua privacidade. Esta Política de Privacidade explica como lidamos com as informações quando você usa nosso aplicativo Visualização Dinâmica da Carteira Pi (o 'Serviço')."
      },
      {
        "title": "1. Nosso Relacionamento com a Rede Pi",
        "content": "A Visualização Dinâmica da Carteira Pi é um aplicativo independente de terceiros. NÃO é um aplicativo oficial da Rede Pi ou da Equipe Principal Pi. Esta política descreve o tratamento de dados pela Visualização Dinâmica da Carteira Pi, não pela própria Rede Pi. Para as práticas de privacidade da Rede Pi, consulte a política de privacidade oficial deles."
      },
      {
        "title": "2. Informações que Lidamos",
        "content": "Quando você usa a Visualização Dinâmica da Carteira Pi, o aplicativo é projetado para exibir informações relacionadas à sua conta da Rede Pi, que podem incluir:\n- Seu saldo de Pi e sua discriminação (por exemplo, transferível, não verificado, bloqueios).\n- Sua taxa de mineração de Pi atual.\n- Informações sobre os membros da sua equipe (por exemplo, nome, status, contribuição), conforme potencialmente disponibilizadas pelas APIs da Rede Pi.\n- Dados de desempenho do nó (se você for um operador de nó e esses dados estiverem acessíveis).\n- Informações de perfil que você pode fornecer diretamente na Visualização Dinâmica da Carteira Pi (por exemplo, nome de exibição, biografia).\n\n**Nota Importante sobre a Versão Atual:** A versão atual da Visualização Dinâmica da Carteira Pi usa DADOS FICTÍCIOS (simulados) para todos os recursos. Nenhuma conexão real com sua conta da Rede Pi é feita, e nenhum dado real da Rede Pi é buscado ou armazenado pela Visualização Dinâmica da Carteira Pi."
      },
      {
        "title": "3. Como Usaríamos as Informações (Se Conectado a Dados Reais)",
        "content": "Se a Visualização Dinâmica da Carteira Pi estivesse conectada a dados reais da Rede Pi (o que atualmente não está), as informações seriam usadas exclusivamente para:\n- Fornecer a você os recursos do painel: exibindo suas métricas relacionadas a Pi, informações da equipe e análise de nós.\n- Permitir que você personalize sua experiência no aplicativo (por exemplo, tema, idioma).\nNão venderíamos suas informações pessoais. O acesso aos seus dados da Rede Pi exigiria sua autorização explícita através dos mecanismos oficiais da Rede Pi."
      },
      {
        "title": "4. Armazenamento e Segurança de Dados",
        "content": "A Visualização Dinâmica da Carteira Pi é projetada como um visualizador ou interface. Não armazenaria dados sensíveis da Rede Pi, como chaves privadas. As preferências do aplicativo (tema, idioma) são armazenadas localmente no seu dispositivo. Se lidássemos com dados reais, implementaríamos medidas de segurança razoáveis para proteger as informações exibidas."
      },
      {
        "title": "5. Serviços de Terceiros e Anúncios",
        "content": "A Visualização Dinâmica da Carteira Pi não compartilha seus dados específicos da Rede Pi com anunciantes terceirizados. O aplicativo pode conter elementos de espaço reservado para anúncios que não são funcionais na versão fictícia atual e não rastreiam você."
      },
      {
        "title": "6. Suas Escolhas e Direitos",
        "content": "O controle sobre seus dados da Rede Pi reside em sua conta da Rede Pi e sua plataforma oficial. A Visualização Dinâmica da Carteira Pi, como um visualizador de terceiros, exibiria apenas dados com base nas permissões que você concede através da Rede Pi. As informações de perfil inseridas diretamente na Visualização Dinâmica da Carteira Pi podem ser gerenciadas por você dentro do aplicativo."
      },
      {
        "title": "7. Privacidade das Crianças",
        "content": "A Visualização Dinâmica da Carteira Pi não se destina ao uso por crianças menores de 13 anos (ou a idade relevante em sua jurisdição). Não coletamos intencionalmente informações pessoais de crianças."
      },
      {
        "title": "8. Alterações nesta Política de Privacidade",
        "content": "Podemos atualizar esta Política de Privacidade periodicamente. Notificaremos você sobre quaisquer alterações significativas publicando a nova Política de Privacidade no aplicativo ou em nosso site."
      },
      {
        "title": "9. Contate-Nos",
        "content": "Se você tiver alguma dúvida sobre esta Política de Privacidade, entre em contato conosco em privacy@example.com."
      }
    ],
    "returnToLogin": "Retornar ao Login",
    "returnAction": "Retornar",
    "helpTitle": "Ajuda e Suporte",
    "helpSections": [
      {
        "title": "Bem-vindo à Ajuda e Suporte!",
        "content": "**O que é a Visualização Dinâmica da Carteira Pi?**\nA Visualização Dinâmica da Carteira Pi é um aplicativo de terceiros projetado para oferecer uma interface dinâmica e fácil de usar para visualizar suas métricas relacionadas à Rede Pi. Isso inclui seu saldo de Pi, taxa de mineração atual, informações sobre a atividade de sua equipe e dados de desempenho se você operar um Nó Pi."
      },
      {
        "title": "A Visualização Dinâmica da Carteira Pi é um aplicativo oficial da Rede Pi?",
        "content": "Não, a Visualização Dinâmica da Carteira Pi é um aplicativo independente desenvolvido por entusiastas. Não é oficialmente afiliado, endossado ou patrocinado pela Equipe Principal Pi (Pi Core Team) ou pela Rede Pi."
      },
      {
        "title": "Qual a precisão dos dados mostrados na Visualização Dinâmica da Carteira Pi?",
        "content": "Atualmente, a Visualização Dinâmica da Carteira Pi usa DADOS FICTÍCIOS (SIMULADOS) para todos os seus recursos. Isso é para fins de demonstração e desenvolvimento. Em uma versão futura destinada ao uso real, a precisão dos dados dependeria das informações fornecidas pelas APIs oficiais da Rede Pi e das permissões que você conceder."
      },
      {
        "title": "Visão Geral dos Principais Recursos",
        "content": "*   **Painel:** Visão geral do seu saldo total de Pi, taxa de mineração e membros ativos da equipe.\n*   **Detalhamento do Saldo:** Visão detalhada do seu saldo de Pi, incluindo valores transferíveis, не verificados e bloqueados.\n*   **Gráfico de Flutuação do Saldo:** Representação visual das alterações do seu saldo ao longo do tempo.\n*   **Exibição de Emblemas:** Exibição de emblemas ganhos no ecossistema da Rede Pi (fictício).\n*   **Informações da Equipe:** Informações sobre os membros da sua equipe, seu status e contribuições (fictício).\n*   **Análise de Nó:** Para operadores de nó, métricas como tempo de atividade e pontuação de desempenho (fictício).\n*   **Configurações:** Personalize as preferências de tema e idioma."
      },
      {
        "title": "Solução de Problemas Comuns",
        "content": "*   **Aplicativo não carrega ou mostra erros:** Como a Visualização Dinâmica da Carteira Pi atualmente usa dados fictícios, erros persistentes podem indicar um problema com o próprio aplicativo. Por favor, tente atualizar. Se os problemas persistirem, entre em contato com o suporte.\n*   **Os dados parecem incorretos:** Lembre-se, todos os dados nesta versão são simulados. Eles não refletem sua conta real da Rede Pi."
      },
      {
        "title": "Contatando o Suporte",
        "content": "Se você tiver perguntas específicas sobre o aplicativo Visualização Dinâmica da Carteira Pi, encontrar bugs ou tiver feedback, envie um e-mail para support@example.com.\n\nPara quaisquer perguntas ou problemas relacionados à sua conta real da Rede Pi, mineração, KYC ou políticas oficiais da Rede Pi, consulte os canais de suporte fornecidos pela Rede Pi (por exemplo, suporte no aplicativo oficial Pi, site oficial da Rede Pi e canais da comunidade)."
      }
    ]
  },
  "dashboard": {
    "title": "Painel",
    "kpi_balance": "Saldo Total de Pi",
    "kpi_rate": "Taxa de Mineração Atual",
    "kpi_team": "Membros Ativos da Equipe",
    "balanceBreakdown": {
      "title": "Detalhamento do Saldo",
      "transferableToMainnet": "Transferível para Mainnet",
      "totalUnverifiedPi": "Pi Total Não Verificado",
      "currentlyInLockups": "Atualmente em Bloqueios",
      "disclaimer": "Nota: O Pi não verificado requer que os membros associados concluam o KYC para se tornar transferível."
    },
    "unverifiedPiDetail": {
      "title": "Fontes de Pi Não Verificado",
      "fromReferralTeam": "Da Equipe de Referência",
      "fromSecurityCircle": "Do Círculo de Segurança",
      "fromNodeRewards": "De Recompensas do Nó",
      "fromOtherBonuses": "De Outros Bônus",
      "disclaimer": "Esses valores se tornam transferíveis à medida que suas conexões concluem o KYC ou outras condições são atendidas."
    },
    "unverifiedBalanceChart": {
      "title": "Flutuação do Saldo",
      "yAxisLabel": "Quantidade de Pi",
      "tooltipLabel": "Quantidade",
      "tooltipLabelTransferable": "Transferível",
      "tooltipLabelUnverified": "Não Verificado",
      "periods": {
        "threeMonths": "3M",
        "sixMonths": "6M",
        "twelveMonths": "12M"
      }
    },
    "myBadges": {
      "title": "Meus Emblemas",
      "earnedOn": "Ganho em"
    },
    "miningFocus": {
      "title": "Foco na Mineração",
      "description": "Acompanhe suas metas pessoais de mineração e mantenha-se motivado!",
      "weeklyGoal": "Meta Semanal (Dias)",
      "monthlyGoal": "Meta Mensal (Dias)",
      "daysSuffix": "dias",
      "goalAchieved": "Meta Atingida!",
      "keepGoing": "Continue o ótimo trabalho!",
      "greatProgress": "Fazendo grande progresso!",
      "teamEncouragement": "Incentive sua equipe a permanecer ativa! Suas contribuições ajudam a rede a crescer."
    },
    "teamActivity": {
      "title": "Rally de Mineração da Equipe",
      "yourActivity": "Sua Atividade",
      "lastWeek": "Semana Passada",
      "lastMonth": "Mês Passado",
      "hoursSuffix": "hrs",
      "teamRallyWeekly": "Rally Semanal da Equipe",
      "teamRallyTop10": "Rally Semanal da Equipe (Top 10)",
      "rank": "Classificação",
      "member": "Membro",
      "hours": "Horas",
      "yourRank": "Sua Classificação: #{{rank}} ({{hours}} hrs)",
      "viewFullTeamReport": "Ver Relatório Completo da Equipe",
      "newlyEarnedBadges": "Conquistas Recentes",
      "noTeamMembers": "Nenhum membro da equipe para exibir atividade ainda.",
      "noActivity": "Nenhum dado de atividade para exibir para a equipe."
    }
  },
  "teamInsights": {
    "title": "Informações da Equipe",
    "loading": "Carregando membros da equipe...",
    "error": "Falha ao carregar membros da equipe. Por favor, tente novamente.",
    "empty": "Você ainda não convidou nenhum membro para a equipe.",
    "columns": {
      "member": "Membro",
      "joinDate": "Data de Adesão",
      "status": "Status",
      "contribution": "Contribuição",
      "activityLastWeek": "Atividade (Semana Passada)",
      "activityLastMonth": "Atividade (Mês Passado)",
      "kycStatus": "Status KYC"
    },
    "statusValues": {
      "active": "Ativo",
      "inactive": "Inativo",
      "pending": "Pendente"
    },
    "kycStatusValues": {
      "completed": "Concluído",
      "pending": "Pendente",
      "not_completed": "Não Concluído"
    },
    "contributionTooltip": "Pi não verificado contribuído por este membro da equipe. Torna-se transferível após a conclusão do KYC."
  },
  "nodeAnalysis": {
    "title": "Análise de Nó",
    "isOperator": {
      "uptime": "Tempo de Atividade do Nó",
      "performanceScore": "Pontuação de Desempenho",
      "performanceHistory": "Histórico de Desempenho",
      "yAxisLabel": "Pontuação"
    },
    "isNotOperator": {
      "title": "Torne-se um Operador de Nó",
      "description": "Ajude a proteger a Rede Pi e ganhe recompensas executando um nó. Clique abaixo para saber mais e começar.",
      "button": "Saiba Mais no Site Oficial da Rede Pi"
    }
  },
  "profile": {
    "title": "Editar Perfil",
    "displayName": "Nome de Exibição",
    "bio": "Biografia",
    "profilePicture": "Foto do Perfil",
    "saveButton": "Salvar Perfil",
    "saving": "Salvando...",
    "successToast": "Perfil Salvo!",
    "errorToast": "Falha ao salvar!"
  },
  "settings": {
    "title": "Configurações do Aplicativo",
    "theme": {
      "label": "Tema",
      "light": "Claro",
      "dark": "Escuro",
      "system": "Sistema"
    },
    "language": {
      "label": "Idioma",
      "en": "Inglês",
      "es": "Espanhol",
      "fr": "Francês",
      "ru": "Russo",
      "pt": "Português",
      "ja": "Japonês",
      "zh": "Chinês"
    }
  },
  "shared": {
    "loading": "Carregando...",
    "error": "Ocorreu um erro"
  },
  "dashboardError": {
    "title": "Algo deu errado",
    "description": "Encontramos um problema ao carregar esta parte do painel. Por favor, tente novamente.",
    "detailsLabel": "Detalhes do erro",
    "retryButton": "Tentar Novamente"
  }
}
