
{
  "appName": "Динамический Обзор Кошелька Pi",
  "sidebar": {
    "dashboard": "Панель управления",
    "team": "Статистика команды",
    "node": "Анализ узла",
    "profile": "Профиль",
    "settings": "Настройки",
    "logout": "Выйти",
    "adPlaceholder": "Здесь ваша реклама",
    "help": "Помощь"
  },
  "login": {
    "welcome": "Добро пожаловать в Динамический Обзор Кошелька Pi",
    "button": "Войти с помощью Pi",
    "error": "Ошибка входа. Пожалуйста, попробуйте еще раз."
  },
  "legal": {
    "termsTitle": "Условия обслуживания",
    "termsSections": [
      {
        "title": "Условия обслуживания - Введение",
        "content": "Дата вступления в силу: 26 октября 2023 г.\n\nДобро пожаловать в Динамический Обзор Кошелька Pi! Настоящие Условия обслуживания ('Условия') регулируют использование вами приложения Динамический Обзор Кошелька Pi и любых связанных с ним услуг (совместно именуемых 'Сервис'). Получая доступ к нашему Сервису или используя его, вы соглашаетесь соблюдать настоящие Условия."
      },
      {
        "title": "1. Принятие Условий",
        "content": "Используя Динамический Обзор Кошелька Pi, вы подтверждаете, что прочитали, поняли и согласны с настоящими Условиями. Если вы не согласны с какой-либо частью настоящих Условий, вы не должны использовать Сервис."
      },
      {
        "title": "2. Описание Сервиса",
        "content": "Динамический Обзор Кошелька Pi — это стороннее приложение, предназначенное для предоставления пользователям панели инструментов для просмотра показателей, связанных с их сетью Pi, включая баланс Pi, скорость майнинга, информацию о членах команды и производительность узла. Динамический Обзор Кошелька Pi не является официальным приложением Pi Network и не является кошельком. Он не хранит ваши личные ключи и не облегчает транзакции Pi."
      },
      {
        "title": "3. Использование Сервиса",
        "content": "Вы соглашаетесь использовать Сервис только по его прямому назначению и в соответствии со всеми применимыми законами и нормативными актами. Вы несете ответственность за сохранение конфиденциальности любой информации об учетной записи, связанной с использованием вами сети Pi при взаимодействии с любыми сторонними приложениями."
      },
      {
        "title": "4. Точность данных и тестовые данные",
        "content": "В настоящее время Динамический Обзор Кошелька Pi использует тестовые данные для демонстрационных и разработочных целей. В реальной среде, подключенной к сети Pi, точность отображаемых данных будет зависеть от информации, предоставляемой API сети Pi, и данных, к которым вы разрешите доступ. Динамический Обзор Кошелька Pi не гарантирует абсолютную точность или своевременность данных, поступающих из сети Pi."
      },
      {
        "title": "5. Отказ от гарантий",
        "content": "Сервис предоставляется «как есть» и «по мере доступности» без каких-либо гарантий, явных или подразумеваемых. Динамический Обзор Кошелька Pi не гарантирует, что Сервис будет бесперебойным, безошибочным или полностью безопасным. Динамический Обзор Кошелька Pi не связан с Pi Core Team или Pi Network."
      },
      {
        "title": "6. Ограничение ответственности",
        "content": "В максимальной степени, разрешенной законом, Динамический Обзор Кошелька Pi не несет ответственности за любые косвенные, случайные, специальные, последующие или штрафные убытки, а также за любую потерю прибыли или доходов, понесенных прямо или косвенно, или любую потерю данных, использования, деловой репутации или других нематериальных убытков, возникших в результате (а) вашего доступа к Сервису или его использования, или невозможности доступа или использования Сервиса; (б) любого поведения или контента любой третьей стороны в Сервисе; или (в) несанкционированного доступа, использования или изменения ваших передач или контента, даже если Динамический Обзор Кошелька Pi был уведомлен о возможности таких убытков."
      },
      {
        "title": "7. Интеллектуальная собственность",
        "content": "Название Динамический Обзор Кошелька Pi, логотип и все связанные с ним названия, логотипы, названия продуктов и услуг, дизайны и слоганы являются товарными знаками Динамического Обзора Кошелька Pi или его лицензиаров. Pi Network и логотип Pi являются товарными знаками Pi Community Company. Данный Сервис не одобрен и не связан с Pi Network."
      },
      {
        "title": "8. Изменения Условий",
        "content": "Мы оставляем за собой право изменять настоящие Условия в любое время. Мы приложим все усилия, чтобы уведомить о любых значительных изменениях. Ваше дальнейшее использование Сервиса после таких изменений означает ваше согласие с новыми Условиями."
      },
      {
        "title": "9. Свяжитесь с нами",
        "content": "Если у вас есть какие-либо вопросы относительно настоящих Условий, пожалуйста, свяжитесь с нами по адресу legal@example.com."
      }
    ],
    "privacyTitle": "Политика конфиденциальности",
    "privacySections": [
      {
        "title": "Политика конфиденциальности - Введение",
        "content": "Дата вступления в силу: 26 октября 2023 г.\n\nДинамический Обзор Кошелька Pi ('мы', 'нас' или 'наш') обязуется защищать вашу конфиденциальность. Настоящая Политика конфиденциальности объясняет, как мы обрабатываем информацию, когда вы используете наше приложение Динамический Обзор Кошелька Pi ('Сервис')."
      },
      {
        "title": "1. Наши отношения с Pi Network",
        "content": "Динамический Обзор Кошелька Pi является независимым сторонним приложением. Это НЕ официальное приложение Pi Network или Pi Core Team. Эта политика описывает обработку данных Динамическим Обзором Кошелька Pi, а не самой Pi Network. Для ознакомления с практиками конфиденциальности Pi Network, пожалуйста, обратитесь к их официальной политике конфиденциальности."
      },
      {
        "title": "2. Информация, которую мы обрабатываем",
        "content": "Когда вы используете Динамический Обзор Кошелька Pi, приложение предназначено для отображения информации, связанной с вашей учетной записью Pi Network, которая может включать:\n- Ваш баланс Pi и его разбивку (например, переводимый, непроверенный, заблокированный).\n- Вашу текущую скорость майнинга Pi.\n- Информацию о членах вашей команды (например, имя, статус, вклад), потенциально предоставляемую API Pi Network.\n- Данные о производительности узла (если вы являетесь оператором узла и эти данные доступны).\n- Информацию профиля, которую вы можете предоставить непосредственно в Динамическом Обзоре Кошелька Pi (например, отображаемое имя, биография).\n\n**Важное примечание по текущей версии:** Текущая версия Динамического Обзора Кошелька Pi использует ТЕСТОВЫЕ (смоделированные) ДАННЫЕ для всех функций. Фактическое подключение к вашей учетной записи Pi Network не производится, и никакие реальные данные Pi Network не извлекаются и не хранятся Динамическим Обзором Кошелька Pi."
      },
      {
        "title": "3. Как мы бы использовали информацию (при подключении к реальным данным)",
        "content": "Если бы Динамический Обзор Кошелька Pi был подключен к реальным данным Pi Network (чего в настоящее время нет), информация использовалась бы исключительно для:\n- Предоставления вам функций панели инструментов: отображения ваших показателей, связанных с Pi, статистики команды и анализа узла.\n- Позволения вам настраивать ваш опыт использования приложения (например, тема, язык).\nМы не будем продавать вашу личную информацию. Доступ к вашим данным Pi Network потребует вашего явного разрешения через официальные механизмы Pi Network."
      },
      {
        "title": "4. Хранение и безопасность данных",
        "content": "Динамический Обзор Кошелька Pi разработан как средство просмотра или интерфейс. Он не будет хранить конфиденциальные данные Pi Network, такие как личные ключи. Предпочтения приложения (тема, язык) хранятся локально на вашем устройстве. При обработке реальных данных мы бы внедрили разумные меры безопасности для защиты отображаемой информации."
      },
      {
        "title": "5. Сторонние сервисы и реклама",
        "content": "Динамический Обзор Кошелька Pi не передает ваши специфические данные Pi Network сторонним рекламодателям. Приложение может содержать элементы-заполнители для рекламы, которые не функционируют в текущей тестовой версии и не отслеживают вас."
      },
      {
        "title": "6. Ваши выборы и права",
        "content": "Контроль над вашими данными Pi Network осуществляется через вашу учетную запись Pi Network и ее официальную платформу. Динамический Обзор Кошелька Pi, как стороннее средство просмотра, будет отображать данные только на основании разрешений, предоставленных вами через Pi Network. Информация профиля, введенная непосредственно в Динамический Обзор Кошелька Pi, может управляться вами в приложении."
      },
      {
        "title": "7. Конфиденциальность детей",
        "content": "Динамический Обзор Кошелька Pi не предназначен для использования детьми младше 13 лет (или соответствующего возраста в вашей юрисдикции). Мы сознательно не собираем личную информацию от детей."
      },
      {
        "title": "8. Изменения в настоящей Политике конфиденциальности",
        "content": "Мы можем время от времени обновлять настоящую Политику конфиденциальности. Мы уведомим вас о любых значительных изменениях, опубликовав новую Политику конфиденциальности в приложении или на нашем веб-сайте."
      },
      {
        "title": "9. Свяжитесь с нами",
        "content": "Если у вас есть какие-либо вопросы относительно настоящей Политики конфиденциальности, пожалуйста, свяжитесь с нами по адресу privacy@example.com."
      }
    ],
    "returnToLogin": "Вернуться к входу",
    "returnAction": "Вернуться",
    "helpTitle": "Помощь и поддержка",
    "helpSections": [
      {
        "title": "Добро пожаловать в Помощь и поддержку!",
        "content": "**Что такое Динамический Обзор Кошелька Pi?**\nДинамический Обзор Кошелька Pi — это стороннее приложение, предназначенное для предоставления динамичного и удобного интерфейса для просмотра ваших показателей, связанных с Pi Network. Это включает ваш баланс Pi, текущую скорость майнинга, информацию об активности вашей команды и данные о производительности, если вы управляете узлом Pi."
      },
      {
        "title": "Является ли Динамический Обзор Кошелька Pi официальным приложением Pi Network?",
        "content": "Нет, Динамический Обзор Кошелька Pi — это независимое приложение, разработанное энтузиастами. Оно официально не связано, не одобрено и не спонсируется Pi Core Team или Pi Network."
      },
      {
        "title": "Насколько точны данные, отображаемые в Динамическом Обзоре Кошелька Pi?",
        "content": "В настоящее время Динамический Обзор Кошелька Pi использует ТЕСТОВЫЕ (СМОДЕЛИРОВАННЫЕ) ДАННЫЕ для всех своих функций. Это делается в демонстрационных и разработочных целях. В будущей версии, предназначенной для реального использования, точность данных будет зависеть от информации, предоставляемой официальными API Pi Network, и разрешений, которые вы предоставите."
      },
      {
        "title": "Обзор ключевых функций",
        "content": "*   **Панель управления:** Обзор вашего общего баланса Pi, скорости майнинга и активных членов команды.\n*   **Разбивка баланса:** Подробный обзор вашего баланса Pi, включая переводимые, непроверенные и заблокированные суммы.\n*   **График колебаний баланса:** Визуальное представление изменений вашего баланса с течением времени.\n*   **Витрина значков:** Отображение заработанных значков в экосистеме Pi Network (тестовые данные).\n*   **Статистика команды:** Информация о членах вашей команды, их статусе и вкладе (тестовые данные).\n*   **Анализ узла:** Для операторов узлов — такие показатели, как время безотказной работы и оценка производительности (тестовые данные).\n*   **Настройки:** Настройка предпочтений темы и языка."
      },
      {
        "title": "Устранение распространенных проблем",
        "content": "*   **Приложение не загружается или показывает ошибки:** Поскольку Динамический Обзор Кошелька Pi в настоящее время использует тестовые данные, постоянные ошибки могут указывать на проблему с самим приложением. Пожалуйста, попробуйте обновить страницу. Если проблемы сохраняются, обратитесь в службу поддержки.\n*   **Данные кажутся неверными:** Помните, что все данные в этой версии смоделированы. Они не отражают ваш фактический счет в Pi Network."
      },
      {
        "title": "Обращение в службу поддержки",
        "content": "Если у вас есть вопросы, касающиеся приложения Динамический Обзор Кошелька Pi, вы столкнулись с ошибками или у вас есть отзывы, пожалуйста, напишите нам по адресу support@example.com.\n\nПо любым вопросам или проблемам, связанным с вашим фактическим счетом в Pi Network, майнингом, KYC или официальной политикой Pi Network, пожалуйста, обращайтесь по каналам поддержки, предоставляемым Pi Network (например, поддержка в официальном приложении Pi, официальный веб-сайт Pi Network и каналы сообщества)."
      }
    ]
  },
  "dashboard": {
    "title": "Панель управления",
    "kpi_balance": "Общий баланс Pi",
    "kpi_rate": "Текущая скорость майнинга",
    "kpi_team": "Активные члены команды",
    "balanceBreakdown": {
      "title": "Разбивка баланса",
      "transferableToMainnet": "Переводимый на Mainnet",
      "totalUnverifiedPi": "Всего непроверенного Pi",
      "currentlyInLockups": "В настоящее время в блокировках",
      "disclaimer": "Примечание: Непроверенный Pi требует, чтобы связанные участники прошли KYC, чтобы стать переводимым."
    },
    "unverifiedPiDetail": {
      "title": "Источники непроверенного Pi",
      "fromReferralTeam": "От реферальной команды",
      "fromSecurityCircle": "От круга безопасности",
      "fromNodeRewards": "От вознаграждений узла",
      "fromOtherBonuses": "От других бонусов",
      "disclaimer": "Эти суммы становятся переводимыми по мере того, как ваши связи проходят KYC или выполняются другие условия."
    },
    "unverifiedBalanceChart": {
      "title": "Колебания баланса",
      "yAxisLabel": "Количество Pi",
      "tooltipLabel": "Количество",
      "tooltipLabelTransferable": "Переводимый",
      "tooltipLabelUnverified": "Непроверенный",
      "periods": {
        "threeMonths": "3М",
        "sixMonths": "6М",
        "twelveMonths": "12М"
      }
    },
    "myBadges": {
      "title": "Мои значки",
      "earnedOn": "Заработано"
    },
    "miningFocus": {
      "title": "Фокус на майнинге",
      "description": "Отслеживайте свои личные цели майнинга и оставайтесь мотивированными!",
      "weeklyGoal": "Недельная цель (Дней)",
      "monthlyGoal": "Месячная цель (Дней)",
      "daysSuffix": "дней",
      "goalAchieved": "Цель достигнута!",
      "keepGoing": "Продолжайте в том же духе!",
      "greatProgress": "Отличный прогресс!",
      "teamEncouragement": "Поощряйте свою команду оставаться активной! Их вклад помогает сети расти."
    },
    "teamActivity": {
      "title": "Командный майнинг-марафон",
      "yourActivity": "Ваша активность",
      "lastWeek": "Прошлая неделя",
      "lastMonth": "Прошлый месяц",
      "hoursSuffix": "ч",
      "teamRallyWeekly": "Еженедельный командный марафон",
      "teamRallyTop10": "Еженедельный командный марафон (Топ 10)",
      "rank": "Ранг",
      "member": "Участник",
      "hours": "Часы",
      "yourRank": "Ваш ранг: #{{rank}} ({{hours}} ч)",
      "viewFullTeamReport": "Посмотреть полный отчет по команде",
      "newlyEarnedBadges": "Недавние достижения",
      "noTeamMembers": "Пока нет членов команды для отображения активности.",
      "noActivity": "Нет данных об активности команды для отображения."
    }
  },
  "teamInsights": {
    "title": "Статистика команды",
    "loading": "Загрузка членов команды...",
    "error": "Не удалось загрузить членов команды. Пожалуйста, попробуйте еще раз.",
    "empty": "Вы еще не пригласили ни одного члена команды.",
    "columns": {
      "member": "Участник",
      "joinDate": "Дата присоединения",
      "status": "Статус",
      "contribution": "Вклад",
      "activityLastWeek": "Активность (Прошлая неделя)",
      "activityLastMonth": "Активность (Прошлый месяц)",
      "kycStatus": "Статус KYC"
    },
    "statusValues": {
      "active": "Активен",
      "inactive": "Неактивен",
      "pending": "В ожидании"
    },
    "kycStatusValues": {
      "completed": "Завершено",
      "pending": "В ожидании",
      "not_completed": "Не завершено"
    },
    "contributionTooltip": "Непроверенный Pi, внесенный этим членом команды. Становится переводимым после того, как он пройдет KYC."
  },
  "nodeAnalysis": {
    "title": "Анализ узла",
    "isOperator": {
      "uptime": "Время безотказной работы узла",
      "performanceScore": "Оценка производительности",
      "performanceHistory": "История производительности",
      "yAxisLabel": "Оценка"
    },
    "isNotOperator": {
      "title": "Станьте оператором узла",
      "description": "Помогите защитить сеть Pi и получайте вознаграждения, запустив узел. Нажмите ниже, чтобы узнать больше и начать.",
      "button": "Узнать больше на официальном сайте Pi Network"
    }
  },
  "profile": {
    "title": "Редактировать профиль",
    "displayName": "Отображаемое имя",
    "bio": "Биография",
    "profilePicture": "Фотография профиля",
    "saveButton": "Сохранить профиль",
    "saving": "Сохранение...",
    "successToast": "Профиль сохранен!",
    "errorToast": "Ошибка сохранения!"
  },
  "settings": {
    "title": "Настройки приложения",
    "theme": {
      "label": "Тема",
      "light": "Светлая",
      "dark": "Темная",
      "system": "Системная"
    },
    "language": {
      "label": "Язык",
      "en": "Английский",
      "es": "Испанский",
      "fr": "Французский",
      "ru": "Русский",
      "pt": "Португальский",
      "ja": "Японский",
      "zh": "Китайский"
    }
  },
  "shared": {
    "loading": "Загрузка...",
    "error": "Произошла ошибка"
  },
  "dashboardError": {
    "title": "Что-то пошло не так",
    "description": "Мы столкнулись с проблемой при загрузке этой части панели управления. Пожалуйста, попробуйте еще раз.",
    "detailsLabel": "Детали ошибки",
    "retryButton": "Попробовать снова"
  }
}
